Revit 2027 API
Document.Close Method
Closes the document.
Overload List
Name | Description
Close() | Closes the document, save the changes if there are.
Close(Boolean) | Closes the document with the option to save.
Top
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace